hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/include/ax25.h
/**
 * @brief Decode a raw AX.25 frame (without FCS) into a structured message.
 *
 * Reads nothing outside the @p len bytes it is given. The address field is
 * walked one address at a time and each step is checked against the end of
 * the frame first, so a header whose address-extension bits claim more
 * repeaters than the frame can hold - a truncated or corrupted reception -
 * is rejected instead of decoding bytes that lie past the frame in the
 * caller's buffer. The same applies to the control and PID fields: they are
 * only read once the frame is known to still hold them.
 *
 * @param buf    Raw frame bytes (address field onwards, no FCS).
 * @param len    Length, in bytes, of @p buf. Only these bytes are read.
 * @param mVrms  RMS input level measured while this frame was received, in
 *               millivolts.
 * @param msg    Destination structure to fill with the decoded fields.
 * @param reason Optional (may be NULL). Set to the specific ::Ax25DecodeReason
 *               for the result: ::AX25_DECODE_OK on success, or the precise
 *               rejection cause on failure - letting the caller separate a
 *               malformed/corrupted reception from a well-formed frame that
 *               is simply not APRS (legacy connected-mode traffic or a
 *               non-APRS PID sharing the channel).
 * @return true if the frame was a well-formed UI frame with a "no layer 3"
 *         PID (i.e. a decodable APRS frame - @p msg is fully populated,
 *         including @c info / @c len). false if the frame is shorter than a
 *         minimal UI header, if its address field runs past @p len, or if
 *         decoding stopped early because the control field wasn't UI or the
 *         PID wasn't AX25_PID_NOLAYER3 (corrupted frame, or legitimate
 *         non-APRS AX.25 traffic) - in that case only @c dst / @c src /
 *         @c rpt_list / @c rpt_count / @c ctrl (and @c pid, if reached) are
 *         valid; @c info / @c len are not touched by this call and must not
 *         be relied upon by the caller.
 */
bool ax25_decode(uint8_t *buf, size_t len, uint16_t mVrms, ax25_msg_t *msg, enum Ax25DecodeReason *reason);

/**
 * @brief Parse a TNC2-style monitor string into an ::ax25_frame_t structure.
 *
 * @p txt is rewritten in place: the digipeater path is compacted to the front
 * of the buffer and tokenized there, so the caller must pass a scratch copy it
 * owns and must not expect the string to survive the call. Beyond that the
 * function keeps no state of its own and may be called from several tasks at
 * once, each with its own @p frame and @p txt.
 *
 * @param frame Destination structure to fill.
 * @param txt   TNC2 monitor string, in the form
 *              "SRC>DST,PATH:payload". Must be NUL-terminated.
 * @param size  Number of bytes of @p txt to parse, i.e. its string length.
 * @return Non-zero on success, zero if the string could not be parsed: an
 *         empty argument, no information field, or a header whose '>' does
 *         not precede the ':' that opens that field.
 */
char ax25_encode(ax25_frame_t *frame, char *txt, int size);

/**
 * @brief Serialize an ::ax25_frame_t structure into a raw AX.25 frame.
 * @param outbuf     Destination buffer for the serialized frame.
 * @param outbuf_len Size, in bytes, of @p outbuf.
 * @param ctx        AX.25 codec context to use/update while serializing.
 * @param pkg        Frame to serialize.
 * @return Number of bytes written to @p outbuf (no HDLC flags, no FCS), or 0
 *         if the address field or the control/PID pair does not fit the
 *         internal frame buffer, or if the built frame is longer than
 *         @p outbuf_len.
 */
int hdlcFrame(uint8_t *outbuf, size_t outbuf_len, ax25_ctx_t *ctx, ax25_frame_t *pkg);

#endif /* LIB_AX25_H_ */
